nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/eth/processor/eth_p32mz1024efm100.h
PLIB_INLINE_API uint8_t PLIB_ETH_BackToBackIPGGet(ETH_MODULE_ID index)
{
     return ETH_BackToBackIPGGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_BackToBackIPGSet(ETH_MODULE_ID index, uint8_t backToBackIPGValue)
{
     ETH_BackToBackIPGSet_Default(index, backToBackIPGValue);
}

PLIB_INLINE_API uint8_t PLIB_ETH_NonBackToBackIPG1Get(ETH_MODULE_ID index)
{
     return ETH_NonBackToBackIPG1Get_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_NonBackToBackIPG1Set(ETH_MODULE_ID index, uint8_t nonBackToBackIPGValue)
{
     ETH_NonBackToBackIPG1Set_Default(index, nonBackToBackIPGValue);
}

PLIB_INLINE_API uint8_t PLIB_ETH_NonBackToBackIPG2Get(ETH_MODULE_ID index)
{
     return ETH_NonBackToBackIPG2Get_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_NonBackToBackIPG2Set(ETH_MODULE_ID index, uint8_t nonBackToBackIPGValue)
{
     ETH_NonBackToBackIPG2Set_Default(index, nonBackToBackIPGValue);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsInterPacketGaps(ETH_MODULE_ID index)
{
     return ETH_ExistsInterPacketGaps_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_ETH_CollisionWindowGet(ETH_MODULE_ID index)
{
     return ETH_CollisionWindowGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_CollisionWindowSet(ETH_MODULE_ID index, uint8_t collisionWindowValue)
{
     ETH_CollisionWindowSet_Default(index, collisionWindowValue);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsCollisionWindow(ETH_MODULE_ID index)
{
     return ETH_ExistsCollisionWindow_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_ETH_ReTxMaxGet(ETH_MODULE_ID index)
{
     return ETH_ReTxMaxGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_ReTxMaxSet(ETH_MODULE_ID index, uint16_t retransmitMax)
{
     ETH_ReTxMaxSet_Default(index, retransmitMax);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsRetransmissionMaximum(ETH_MODULE_ID index)
{
     return ETH_ExistsRetransmissionMaximum_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_ETH_MaxFrameLengthGet(ETH_MODULE_ID index)
{
     return ETH_MaxFrameLengthGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MaxFrameLengthSet(ETH_MODULE_ID index, uint16_t MaxFrameLength)
{
     ETH_MaxFrameLengthSet_Default(index, MaxFrameLength);
}

PLIB_INLINE_API void PLIB_ETH_MACSetMaxFrame(ETH_MODULE_ID index, uint16_t maxFrmSz)
{
     ETH_MACSetMaxFrame_Default(index, maxFrmSz);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsMaxFrameLength(ETH_MODULE_ID index)
{
     return ETH_ExistsMaxFrameLength_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RMIIResetEnable(ETH_MODULE_ID index)
{
     ETH_RMIIResetEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RMIIResetDisable(ETH_MODULE_ID index)
{
     ETH_RMIIResetDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_RMIIResetIsEnabled(ETH_MODULE_ID index)
{
     return ETH_RMIIResetIsEnabled_Default(index);
}

PLIB_INLINE_API ETH_RMII_SPEED PLIB_ETH_RMIISpeedGet(ETH_MODULE_ID index)
{
     return ETH_RMIISpeedGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RMIISpeedSet(ETH_MODULE_ID index, ETH_RMII_SPEED RMIISpeed)
{
     ETH_RMIISpeedSet_Default(index, RMIISpeed);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsRMII_Support(ETH_MODULE_ID index)
{
     return ETH_ExistsRMII_Support_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_TestBackPressEnable(ETH_MODULE_ID index)
{
     ETH_TestBackPressEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_TestBackPressDisable(ETH_MODULE_ID index)
{
     ETH_TestBackPressDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_TestBackPressIsEnabled(ETH_MODULE_ID index)
{
     return ETH_TestBackPressIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_TestPauseEnable(ETH_MODULE_ID index)
{
     ETH_TestPauseEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_TestPauseDisable(ETH_MODULE_ID index)
{
     ETH_TestPauseDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_TestPauseIsEnabled(ETH_MODULE_ID index)
{
     return ETH_TestPauseIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_ShortcutQuantaEnable(ETH_MODULE_ID index)
{
     ETH_ShortcutQuantaEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_ShortcutQuantaDisable(ETH_MODULE_ID index)
{
     ETH_ShortcutQuantaDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ShortcutQuantaIsEnabled(ETH_MODULE_ID index)
{
     return ETH_ShortcutQuantaIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsMAC_Testing(ETH_MODULE_ID index)
{
     return ETH_ExistsMAC_Testing_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MIIMResetEnable(ETH_MODULE_ID index)
{
     ETH_MIIMResetEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MIIMResetDisable(ETH_MODULE_ID index)
{
     ETH_MIIMResetDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_MIIMResetIsEnabled(ETH_MODULE_ID index)
{
     return ETH_MIIMResetIsEnabled_Default(index);
}

PLIB_INLINE_API ETH_MIIM_CLK PLIB_ETH_MIIMClockGet(ETH_MODULE_ID index)
{
     return ETH_MIIMClockGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MIIMClockSet(ETH_MODULE_ID index, ETH_MIIM_CLK MIIMClock)
{
     ETH_MIIMClockSet_Default(index, MIIMClock);
}

PLIB_INLINE_API void PLIB_ETH_MIIMNoPreEnable(ETH_MODULE_ID index)
{
     ETH_MIIMNoPreEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MIIMNoPreDisable(ETH_MODULE_ID index)
{
     ETH_MIIMNoPreDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_MIIMNoPreIsEnabled(ETH_MODULE_ID index)
{
     return ETH_MIIMNoPreIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MIIMScanIncrEnable(ETH_MODULE_ID index)
{
     ETH_MIIMScanIncrEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MIIMScanIncrDisable(ETH_MODULE_ID index)
{
     ETH_MIIMScanIncrDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_MIIMScanIncrIsEnabled(ETH_MODULE_ID index)
{
     return ETH_MIIMScanIncrIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsMIIM_Config(ETH_MODULE_ID index)
{
     return ETH_ExistsMIIM_Config_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MIIMScanModeEnable(ETH_MODULE_ID index)
{
     ETH_MIIMScanModeEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MIIMScanModeDisable(ETH_MODULE_ID index)
{
     ETH_MIIMScanModeDisable_Default(index);
}

